mother('Роза Котова', 'Владимир Епанешников').
mother('Роза Котова', 'Владислав Епанешников').
mother('Пелагея Колесникова', 'Иван Котов Старший').
mother('Пелагея Колесникова', 'Надежда Котова').
mother('Пелагея Колесникова', 'Нина Котова').
mother('Пелагея Колесникова', 'Иван Котов Младший').
mother('Пелагея Колесникова', 'Роза Котова').
mother('Пелагея Колесникова', 'Артур Котов').
mother('Ирина Андрианова', 'Алёна Котова').
mother('Ирина Андрианова', 'Алексей Котов').
mother('Ирина Васильева', 'Кристина Котова').
mother('Ирина Васильева', 'Ксения Котова').
mother('Нина Котова', 'Ирина Калачёва').
mother('Нина Котова', 'Алёна Калачёва').
mother('Миннурый Ситдикова', 'Эдуард Котов').
mother('Миннурый Ситдикова', 'Роза Галиева').
mother('Тамара Тропезникова', 'Сергей Епанешников').
mother('Ирина Калачёва', 'Вера Воскобойникова').
mother('Алёна Калачёва', 'Полина Калачёва').
mother('Кристина Котова', 'Арина Гибадулина').
mother('Надежда Котова', 'Владимир Атландеров').
mother('Резеда Котова', 'Руслан Котов').
mother('Роза Галиева', 'Камилла Галиева').
mother('Роза Галиева', 'Саида Галиева').
mother('Мария Долганова', 'Ирина Васильева').
mother('Анастасия Колесникова', 'Пелагея Колесникова').
mother('Анастасия Колесникова', 'Анна Колесникова').
mother('Анастасия Колесникова', 'Илья Колесников').
mother('Анастасия Колесникова', 'Иван Колесников').
mother('Любовь Кондратьева', 'Людмила Андрианова').
mother('Любовь Кондратьева', 'Ирина Андрианова').
mother('Мария Куликова', 'Николай Кондратьев').
mother('Мария Куликова', 'Виктор Кондратьев').
mother('Мария Куликова', 'Любовь Кондратьева').
mother('Любовь Андрианова', 'Алексей Андрианов').
mother('Любовь Андрианова', 'Зинаида Андрианов').
mother('Любовь Андрианова', 'Николай Андрианов').
mother('Любовь Андрианова', 'Елена Андрианов').
mother('Нина Насибуллина', 'Виталий Кондратьев').
mother('Нина Насибуллина', 'Владимир Кондратьев').
mother('Нина Насибуллина', 'Андрей Кондратьев').
father('Сергей Епанешников', 'Владимир Епанешников').
father('Сергей Епанешников', 'Владислав Епанешников').
father('Иван Котов Отец', 'Иван Котов Старший').
father('Иван Котов Отец', 'Надежда Котова').
father('Иван Котов Отец', 'Нина Котова').
father('Иван Котов Отец', 'Иван Котов Младший').
father('Иван Котов Отец', 'Роза Котова').
father('Иван Котов Отец', 'Артур Котов').
father('Артур Котов', 'Алёна Котова').
father('Артур Котов', 'Алексей Котов').
father('Иван Котов Младший', 'Кристина Котова').
father('Иван Котов Младший', 'Ксения Котова').
father('Олег Калачёв', 'Ирина Калачёва').
father('Олег Калачёв', 'Алёна Калачёва').
father('Иван Котов Старший', 'Эдуард Котов').
father('Иван Котов Старший', 'Роза Галиева').
father('Вова Епанешников', 'Сергей Епанешников').
father('Павел Воскобойников', 'Вера Воскобойникова').
father('Павел Акопов', 'Полина Калачёва').
father('Ильнар Гибадулин', 'Арина Гибадулина').
father('Андрей Атландеров', 'Владимир Атландеров').
father('Эдуард Котов', 'Руслан Котов').
father('Радик Галиев', 'Камилла Галиева').
father('Радик Галиев', 'Саида Галиева').
father('Николай Васильев', 'Ирина Васильева').
father('Егор Колесников', 'Пелагея Колесникова').
father('Егор Колесников', 'Анна Колесникова').
father('Егор Колесников', 'Илья Колесников').
father('Егор Колесников', 'Иван Колесников').
father('Алексей Андрианов', 'Людмила Андрианова').
father('Алексей Андрианов', 'Ирина Андрианова').
father('Савелий Кондратьев', 'Николай Кондратьев').
father('Савелий Кондратьев', 'Виктор Кондратьев').
father('Савелий Кондратьев', 'Любовь Кондратьева').
father('Валентин Андрианов', 'Алексей Андрианов').
father('Валентин Андрианов', 'Зинаида Андрианов').
father('Валентин Андрианов', 'Николай Андрианов').
father('Валентин Андрианов', 'Елена Андрианов').
father('Виктор Кондратьев', 'Виталий Кондратьев').
father('Виктор Кондратьев', 'Владимир Кондратьев').
father('Виктор Кондратьев', 'Андрей Кондратьев').
sex('Андрей Кондратьев', 'M').
sex('Анна Колесникова', 'F').
sex('Виталий Кондратьев', 'M').
sex('Андрей Атландеров', 'M').
sex('Николай Андрианов', 'M').
sex('Пелагея Колесникова', 'F').
sex('Зинаида Андрианов', 'F').
sex('Анастасия Колесникова', 'F').
sex('Роза Котова', 'F').
sex('Владимир Атландеров', 'M').
sex('Олег Калачёв', 'M').
sex('Николай Васильев', 'M').
sex('Ксения Котова', 'F').
sex('Алёна Котова', 'F').
sex('Кристина Котова', 'F').
sex('Алексей Котов', 'M').
sex('Камилла Галиева', 'F').
sex('Иван Котов Отец', 'M').
sex('Ирина Васильева', 'F').
sex('Вера Воскобойникова', 'F').
sex('Павел Воскобойников', 'M').
sex('Руслан Котов', 'M').
sex('Роза Галиева', 'F').
sex('Арина Гибадулина', 'F').
sex('Ильнар Гибадулин', 'M').
sex('Нина Котова', 'F').
sex('Надежда Котова', 'F').
sex('Тамара Тропезникова', 'F').
sex('Елена Андрианов', 'F').
sex('Миннурый Ситдикова', 'F').
sex('Иван Колесников', 'M').
sex('Радик Галиев', 'M').
sex('Савелий Кондратьев', 'M').
sex('Резеда Котова', 'F').
sex('Мария Куликова', 'F').
sex('Людмила Андрианова', 'F').
sex('Нина Насибуллина', 'F').
sex('Илья Колесников', 'M').
sex('Николай Кондратьев', 'M').
sex('Виктор Кондратьев', 'M').
sex('Любовь Андрианова', 'F').
sex('Валентин Андрианов', 'M').
sex('Любовь Кондратьева', 'F').
sex('Егор Колесников', 'M').
sex('Владимир Кондратьев', 'M').
sex('Алексей Андрианов', 'M').
sex('Эдуард Котов', 'M').
sex('Алёна Калачёва', 'F').
sex('Иван Котов Младший', 'M').
sex('Ирина Калачёва', 'F').
sex('Владислав Епанешников', 'M').
sex('Вова Епанешников', 'M').
sex('Сергей Епанешников', 'M').
sex('Владимир Епанешников', 'M').
sex('Саида Галиева', 'F').
sex('Павел Акопов', 'M').
sex('Полина Калачёва', 'F').
sex('Ирина Андрианова', 'F').
sex('Иван Котов Старший', 'M').
sex('Мария Долганова', 'F').
sex('Артур Котов', 'M').
